hristoandreev/stm32f469i-disc-esp32/Core/Src/main.c
    /* wait until to connected pppos. */
    do {
        (void) osMessageQueueGet(web_queue_responseHandle, &state, (uint8_t *) 24, osWaitForever);
    }while(state != httpc_READY);

    while(1) {
        web.uri = "http://192.168.3.1/wifi?cmd=scan";
        web.type = GET;
        web.in_buff = in_buff;
        web.in_buff_size = sizeof(in_buff);
        web.out_buff = NULL;
        web.out_buff_size = 0;
        (void)osMessageQueuePut(web_queue_requestHandle, &web, 24, 1000);
        printf("HTTPS Request: %s\n", web.uri);
        osMessageQueueGet(web_queue_responseHandle, &state, NULL, osWaitForever);
        if (state == httpc_OK)
            printf("HTTPS Response: %s\n", in_buff);
        else
            printf("HTTPS Response: %s\n", "ERROR!");
        /* Infinite loop */
        for (;;) {
            osDelay(100);
        }
    }
  /* USER CODE END HTTPSClientTest_Task */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
